{"config": [{"config": {"batch_input_shape": [null, 3, 100, 100], "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "trainable": true, "filters": 32, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "padding": "same", "dtype": "float32", "dilation_rate": [1, 1], "bias_regularizer": null, "name": "conv2d_1", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "name": "conv2d_2", "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 64, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "name": "conv2d_3", "strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "filters": 128, "data_format": "channels_first", "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"pool_size": [8, 8], "trainable": true, "strides": [8, 8], "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_constraint": null, "units": 28, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.4"}