{"keras_version": "2.0.4", "backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_57", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 3, 64, 64], "data_format": "channels_first", "dtype": "float32", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_58", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_28", "data_format": "channels_first", "pool_size": [3, 3], "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_20", "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_59", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 64, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_60", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_29", "data_format": "channels_first", "pool_size": [3, 3], "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_21", "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "filters": 128, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_61", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 128, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_62", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_22", "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activity_regularizer": null, "filters": 256, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_63", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "filters": 256, "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_64", "strides": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "bias_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_30", "data_format": "channels_first", "pool_size": [3, 3], "strides": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"axis": -1, "gamma_regularizer": null, "scale": true, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_23", "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "name": "dense_1", "units": 256, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "name": "dense_2", "units": 128, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "name": "dense_3", "units": 28, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}